Autodesk.Revit.DB.SpotDimensionTypeSet
A set that contains spotdimension types.

Autodesk.Revit.DB.SpotDimensionTypeSet.Insert(Autodesk.Revit.DB.SpotDimensionType)
System.Int32
Insert the specified spotdimension type into the set.
item: The spotdimension type to be inserted into the set.
Returns: Returns whether the spotdimension type was inserted into the set.

Autodesk.Revit.DB.SpotDimensionTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.SpotDimensionTypeSet.ReverseIterator
Autodesk.Revit.DB.SpotDimensionTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.SpotDimensionTypeSet.ForwardIterator
Autodesk.Revit.DB.SpotDimensionTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.SpotDimensionTypeSet.Erase(Autodesk.Revit.DB.SpotDimensionType)
System.Int32
Removes a specified spotdimension type from the set.
item: The spotdimension type to be erased.
Returns: The number of spotdimension types that were erased from the set.

Autodesk.Revit.DB.SpotDimensionTypeSet.Contains(Autodesk.Revit.DB.SpotDimensionType)
System.Boolean
Tests for the existence of a spotdimension type within the set.
item: The spotdimension type to be searched for.
Returns: The Contains method returns True if the spotdimension type is within the set, otherwise False.

Autodesk.Revit.DB.SpotDimensionTypeSet.Clear
void
Removes every spotdimension type from the set, rendering it empty.

Autodesk.Revit.DB.SpotDimensionTypeSet.Size
System.Int32
get
Returns the number of spotdimension types that are in the set.

Autodesk.Revit.DB.SpotDimensionTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.